Revit 2027 API
CurveElementType Enumeration
 An enumerated type listing the curve element types that can be used when filtering elements (via CurveElementFilter).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CurveElementType
Public Enumeration CurveElementType
public enum class CurveElementType
type CurveElementType
Members
Member name | Value | Description
AreaBasedLoadBoundary | 12 |  An Area Based Load Boundary curve.
AreaSeparation | 7 |  An area separation curve.
Cloud | 11 |  A portion of a revision cloud.
CurveByPoints | 8 |  A curve created by connecting a set of points.
DetailCurve | 2 |  A detail curve.
Insulation | 10 |  A detail curve representing insulation.
Invalid | 0 |  An invalid curve element type.
ModelCurve | 1 |  A model curve.
ReferenceLine | 4 |  A reference line.
RepeatingDetail | 9 |  The profile of a repeating detail set.
RoomSeparation | 6 |  An room separation curve.
SpaceSeparation | 5 |  A space separation curve.
SymbolicCurve | 3 |  A symbolic curve.
See Also
Reference
Autodesk.Revit.DB Namespace